app/views/cart/index.html.erb

<% @cart.each do |id, quantity| %>
	<% event = Event.find_by_id(id) %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]